TexasInstruments/f29h85x-sdk/source/driverlib/hrpwm.h
}

//*****************************************************************************
//
//! Set high resolution Dead Band MEP (Micro Edge Positioner) control.
//!
//! \param base is the base address of the EPWM module.
//! \param mepDBEdge is the high resolution MEP (Micro Edge Positioner) control
//!        edge.
//!
//! This function sets the high resolution Dead Band edge that the MEP (Micro
//! Edge Positioner) controls Valid values for mepDBEdge are:
//!   - HRPWM_DB_MEP_CTRL_DISABLE  - HRPWM is disabled
//!   - HRPWM_DB_MEP_CTRL_RED      - MEP (Micro Edge Positioner) controls
//!                                  Rising Edge Delay
//!   - HRPWM_DB_MEP_CTRL_FED      - MEP (Micro Edge Positioner) controls
//!                                  Falling Edge Delay
//!   - HRPWM_DB_MEP_CTRL_RED_FED  - MEP (Micro Edge Positioner) controls both
//!                                  Falling and Rising edge delays
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
HRPWM_setDeadbandMEPEdgeSelect(uint32_t base,
                               HRPWM_MEPDeadBandEdgeMode mepDBEdge)
{
    //
    // Check the arguments
    //
    ASSERT(HRPWM_isBaseValid(base));

    //
    // Set the HRPWM DB edge mode
    //

    HWREGH(base + EPWM_O_HRCNFG2) =
       ((HWREGH(base + EPWM_O_HRCNFG2) & ~EPWM_HRCNFG2_EDGMODEDB_M) |
         ((uint16_t)mepDBEdge));

}

//*****************************************************************************
//
//! Set the high resolution Dead Band RED load mode.
//!
//! \param base is the base address of the EPWM module.
//! \param loadEvent is the shadow to active load event.
//!
//! This function sets the high resolution Rising Edge Delay(RED)Dead Band
//! count load mode.
//! Valid values for loadEvent are:
//!   - HRPWM_LOAD_ON_CNTR_ZERO        - load when counter equals zero.
//!   - HRPWM_LOAD_ON_CNTR_PERIOD      - load when counter equals period
//!   - HRPWM_LOAD_ON_CNTR_ZERO_PERIOD - load when counter equals zero
//!                                             or period.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
HRPWM_setRisingEdgeDelayLoadMode(uint32_t base,
                                 HRPWM_LoadMode loadEvent)
{
    //
    // Check the arguments
    //
    ASSERT(HRPWM_isBaseValid(base));

    //
    // Set the HRPWM RED load mode
    //

    HWREGH(base + EPWM_O_HRCNFG2) =
      ((HWREGH(base + EPWM_O_HRCNFG2) & ~EPWM_HRCNFG2_CTLMODEDBRED_M) |
       ((uint16_t)loadEvent << EPWM_HRCNFG2_CTLMODEDBRED_S));

}

//*****************************************************************************
//
//! Set the high resolution Dead Band FED load mode.
//!
//! \param base is the base address of the EPWM module.
//! \param loadEvent is the shadow to active load event.
//!
//! This function sets the high resolution Falling Edge Delay(FED) Dead Band
//! count load mode.
//! Valid values for loadEvent are:
//!   - HRPWM_LOAD_ON_CNTR_ZERO        - load when counter equals zero.
//!   - HRPWM_LOAD_ON_CNTR_PERIOD      - load when counter equals period
//!   - HRPWM_LOAD_ON_CNTR_ZERO_PERIOD - load when counter equals zero
//!                                             or period.
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
HRPWM_setFallingEdgeDelayLoadMode(uint32_t base, HRPWM_LoadMode loadEvent)
{
    //
    // Check the arguments
    //
    ASSERT(HRPWM_isBaseValid(base));

    //
    // Set the HRPWM FED load mode
    //

    HWREGH(base + EPWM_O_HRCNFG2) =
       ((HWREGH(base + EPWM_O_HRCNFG2) & ~EPWM_HRCNFG2_CTLMODEDBFED_M) |
        ((uint16_t)loadEvent << EPWM_HRCNFG2_CTLMODEDBFED_S));

}

//*****************************************************************************
//
//!
//! \param base is the base address of the EPWM module.
//!
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
HRPWM_lockRegisters(uint32_t base, HRPWM_LockRegisterGroup registerGroup)
{
    //
    // Check the arguments
    //
    ASSERT(HRPWM_isBaseValid(base));

    //
    // Write the Key to EPWMLOCK register
    //
    HWREG(base + EPWM_O_LOCK) =
                           (0xA5A50000UL | ((uint32_t)registerGroup));
}

//*****************************************************************************
//
//! Sets the consolidated XCMP values in HR mode.
//!
//! \param base is the base address of the EPWM module
//! \param xcmpReg is the XCMP register offset
//! \param xcmpValue is the consolidated value to be written to XCMP registers
//!
//! This function sets the consolidated counter compare(XCMPx:XCMPxHR) value
//! required in high resolution mode for XCMP registers.
//! Valid values for xcmpReg are:
//!    EPWM_XCMP[1-8]_[ACTIVE/SHADOW1/SHADOW2/SHADOW3]
//!                          -XCMP[1-8]_[ACTIVE/SHADOW1/SHADOW2/SHADOW3]
//!    EPWM_XTBPRD_ACTIVE                               -XTBPRD_ACTIVE
//!    EPWM_XTBPRD_SHADOW1                              -XTBPRD_SHADOW1
//!    EPWM_XTBPRD_SHADOW2                              -XTBPRD_SHADOW2
//!    EPWM_XTBPRD_SHADOW3                              -XTBPRD_SHADOW3
//!
//! \b Note: For configuring XCMPx = 0x3E8, XCMPxHR = 0x64; value of
//!          xcmpValue = 0x03E80064
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
HRPWM_setXCMPRegValue(uint32_t base, EPWM_XCMPReg xcmpReg,
                      uint32_t xcmpValue)
{
    //
    // Check the arguments
    //
    ASSERT(EPWM_isBaseValid(base));
    uint32_t registerOffset;
    registerOffset = base + EPWM_O_XCMP +
                     EPWM_O_XCMP1_ACTIVE + (uint32_t)xcmpReg*2U;

    //
    // Write to the XCMP registers.
    //
    HWREG(registerOffset) = xcmpValue;
}

//*****************************************************************************
//
//! Sets only the high resolution XCMP value.
//!
//! \param base is the base address of the EPWM module
//! \param xcmpReg is the XCMP register offset
//! \param hrXcmpValue is the HR value to be written to XCMP registers
//!
//! This function sets the high resolution counter compare value(XCMPx_HR) for
//! XCMP registers.
//! Valid values for xcmpReg are:
//!    EPWM_XCMP[1-8]_[ACTIVE/SHADOW1/SHADOW2/SHADOW3]
//!                          -XCMP[1-8]_[ACTIVE/SHADOW1/SHADOW2/SHADOW3]
//!    EPWM_XTBPRD_ACTIVE                               -XTBPRD_ACTIVE
//!    EPWM_XTBPRD_SHADOW1                              -XTBPRD_SHADOW1
//!    EPWM_XTBPRD_SHADOW2                              -XTBPRD_SHADOW2
//!    EPWM_XTBPRD_SHADOW3                              -XTBPRD_SHADOW3
//!
//! \return None.
//
//*****************************************************************************
__attribute__((always_inline))
static inline void
HRPWM_setHiResXCMPRegValueOnly(uint32_t base, EPWM_XCMPReg xcmpReg,
                               uint32_t hrXcmpValue)
{
    //
    // Check the arguments
    //
    ASSERT(EPWM_isBaseValid(base));
    uint32_t registerOffset;
    registerOffset = base + EPWM_O_XCMP +
                     EPWM_O_XCMP1_ACTIVE + (uint32_t)xcmpReg*2U;

    //
    // Write to the XCMP registers.
    //
    HWREGH(registerOffset) = hrXcmpValue;
}
//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // HRPWM_H
